---
title: ExternalResourceServerUtils
classe: Autodesk.Revit.DB.ExternalResourceServerUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExternalResourceServerUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidShortName(Guid, String)` | `ExternalResourceServerUtils.IsValidShortName(serverId, serverName)` | Boolean |
| `Boolean ServerSupportsAssemblyCodeData(ExternalResourceReference)` | `ExternalResourceServerUtils.ServerSupportsAssemblyCodeData(extRef)` | Boolean |
| `Boolean ServerSupportsCADLinks(ExternalResourceReference)` | `ExternalResourceServerUtils.ServerSupportsCADLinks(extRef)` | Boolean |
| `Boolean ServerSupportsIFCLinks(ExternalResourceReference)` | `ExternalResourceServerUtils.ServerSupportsIFCLinks(extRef)` | Boolean |
| `Boolean ServerSupportsKeynotes(ExternalResourceReference)` | `ExternalResourceServerUtils.ServerSupportsKeynotes(extRef)` | Boolean |
| `Boolean ServerSupportsRevitLinks(ExternalResourceReference)` | `ExternalResourceServerUtils.ServerSupportsRevitLinks(extRef)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```